public_html_fmh/apis/ExpTransitTimeWebService/sampleCode/java/wsExpTransTime_Test/bin/META-INF/wsdl/TimeLookupService.wsdl

<?xml version="1.0" encoding="UTF-8"?><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI IBM 2.2.1-11/30/2010 12:42 PM(foreman)-. --><definitions name="TimeLookupService" targetNamespace="http://time.odfl.com/" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://time.odfl.com/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <types>
    <xsd:schema>
      <xsd:import namespace="http://time.odfl.com/" schemaLocation="TimeLookupService_schema1.xsd"/>
    </xsd:schema>
  </types>
  <message name="getTT">
    <part element="tns:getTT" name="parameters"/>
  </message>
  <message name="getTTResponse">
    <part element="tns:getTTResponse" name="parameters"/>
  </message>
  <portType name="TimeLookupDelegate">
    <operation name="getTT">
      <input message="tns:getTT" wsam:Action="http://time.odfl.com/TimeLookupDelegate/getTTRequest"/>
      <output message="tns:getTTResponse" wsam:Action="http://time.odfl.com/TimeLookupDelegate/getTTResponse"/>
    </operation>
  </portType>
  <binding name="TimeLookupPortBinding" type="tns:TimeLookupDelegate">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <operation name="getTT">
      <soap:operation soapAction=""/>
      <input>
        <soap:body use="literal"/>
      </input>
      <output>
        <soap:body use="literal"/>
      </output>
    </operation>
  </binding>
  <service name="TimeLookupService">
    <port binding="tns:TimeLookupPortBinding" name="TimeLookupPort">
      <soap:address location="http://localhost:9080/wsExpTransTime/TimeLookupService"/>
    </port>
  </service>
</definitions>